IDENTIFICATION DIVISION.
PROGRAM-ID. EXERCISE.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-ARRAY.
   05 WS-NUM OCCURS 5 TIMES PIC 9(02).

01 I        PIC 9(02).
01 J        PIC 9(02).
01 TEMP     PIC 9(02).
01 N        PIC 9(02) VALUE 5.

PROCEDURE DIVISION.

    DISPLAY "BEFORE SORTING: ".

    PERFORM VARYING I FROM 1 BY 1 UNTIL I > N
        ACCEPT WS-NUM(I)
    END-PERFORM.

    PERFORM VARYING I FROM 1 BY 1 UNTIL I >= N
        PERFORM VARYING J FROM 1 BY 1 UNTIL J > N - I
            IF WS-NUM(J) > WS-NUM(J + 1)
                MOVE WS-NUM(J)     TO TEMP
                MOVE WS-NUM(J + 1) TO WS-NUM(J)
                MOVE TEMP          TO WS-NUM(J + 1)
            END-IF
        END-PERFORM
    END-PERFORM.

    DISPLAY "SORTED ARRAY:".

    PERFORM VARYING I FROM 1 BY 1 UNTIL I > N
        DISPLAY WS-NUM(I)
    END-PERFORM.

STOP RUN.