IDENTIFICATION DIVISION.
PROGRAM-ID. EXERCISE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-CEL PIC 9(02)V9(02).
01 WS-FAH PIC 9(02)V9(02).

PROCEDURE DIVISION.
   ACCEPT  WS-CEL.
   COMPUTE WS-FAH = (WS-CEL *  9 / 5) + 32.
   DISPLAY "FAHRENHEIT: "WS-FAH.
STOP RUN.