IDENTIFICATION DIVISION.
PROGRAM-ID. EXERCISE.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-PRINCIPAL     PIC 9(7)V99.
01 WS-RATE          PIC 9(2)V99.
01 WS-TIME          PIC 9(2).
01 WS-AMOUNT        PIC 9(9)V99.
01 WS-CI            PIC 9(9)V99.
01 WS-I             PIC 9(2).
01 WS-FACTOR        PIC 9(3)V99.

PROCEDURE DIVISION.

    ACCEPT WS-PRINCIPAL.
    ACCEPT WS-RATE.
    ACCEPT WS-TIME.

    COMPUTE WS-FACTOR = 1 + (WS-RATE / 100).
    MOVE WS-PRINCIPAL TO WS-AMOUNT.
    MOVE 1 TO WS-I.

    PERFORM UNTIL WS-I > WS-TIME
        COMPUTE WS-AMOUNT = WS-AMOUNT * WS-FACTOR
        ADD 1 TO WS-I
    END-PERFORM.

    COMPUTE WS-CI = WS-AMOUNT - WS-PRINCIPAL.

    DISPLAY "FINAL AMOUNT : " WS-AMOUNT.
    DISPLAY "COMPOUND INTEREST : " WS-CI.

STOP RUN.