IDENTIFICATION DIVISION.
PROGRAM-ID. EXERCISE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-STR1 PIC X(20).
01 WS-STR2 PIC X(20).
01 WS-RESULT PIC X(40).
01 WS-LEN PIC 9(02).

PROCEDURE DIVISION.
  ACCEPT WS-STR1.
  ACCEPT WS-STR2.
  
  STRING WS-STR1 DELIMITED BY SPACE 
         SPACE 
         WS-STR2 DELIMITED BY SPACE 
    INTO WS-RESULT.
  COMPUTE WS-LEN = 
          FUNCTION LENGTH( 
              FUNCTION TRIM(WS-RESULT) 
           ).
  DISPLAY "RESULT : "WS-RESULT.
  DISPLAY "LENGTH : "WS-LEN.
  
STOP RUN.