IDENTIFICATION DIVISION.
PROGRAM-ID.  EXERCISE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-FACT-GRP.
  05 WS-NUM PIC 9(02).
  05 WS-I PIC 9(02).
  05 WS-FACT PIC 9(05).

PROCEDURE DIVISION.
  ACCEPT WS-NUM.
  
  MOVE 1 TO WS-I.
  MOVE 1 TO WS-FACT.
  PERFORM UNTIL WS-I > WS-NUM
    MULTIPLY WS-FACT BY WS-I GIVING WS-FACT
  ADD 1 TO WS-I
  END-PERFORM.
  
  DISPLAY "FACTORIAL: "WS-FACT.
STOP RUN.