IDENTIFICATION DIVISION.
PROGRAM-ID. EXERCISE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-A PIC 9(03) VALUE 0.
01 WS-B PIC 9(03) VALUE 1.
01 WS-NEXT PIC 9(03).
01 WS-SUM PIC 9(04) VALUE 0.

PROCEDURE DIVISION.

   PERFORM UNTIL WS-A > 100
    DISPLAY WS-A
    ADD WS-A TO WS-SUM
    
    COMPUTE WS-NEXT = WS-A + WS-B
    MOVE WS-B TO WS-A
    MOVE WS-NEXT TO WS-B
   END-PERFORM.
   
DISPLAY "SUM OF FIBONACCI NUMBERS: "WS-SUM.
STOP RUN.